var hiragana = [
	[["a", "あ"], ["i", "い"], ["u", "う"], ["e", "え"], ["o", "お"]],
	[["ka", "か"], ["ki", "き"], ["ku", "く"], ["ke", "け"], ["ko", "こ"]],
	[["sa", "さ"], ["shi", "し"], ["su", "す"], ["se", "せ"], ["so", "そ"]],
	[["ta", "た"], ["chi", "ち"], ["tsu", "つ"], ["te", "て"], ["to", "と"]],
	[["na", "な"], ["ni", "に"], ["nu", "ぬ"], ["ne", "ね"], ["no", "の"]],
	[["ha", "は"], ["hi", "ひ"], ["fu", "ふ"], ["he", "へ"], ["ho", "ほ"]],
	[["ma", "ま"], ["mi", "み"], ["mu", "む"], ["me", "め"], ["mo", "も"]],
	[["ra", "ら"], ["ri", "り"], ["ru", "る"], ["re", "れ"], ["ro", "ろ"]],
	[["ya", "や"], ["", ""], ["yu", "ゆ"], ["", ""], ["yo", "よ"]],
	[["wa", "わ"], ["", ""], ["", ""], ["", ""], ["wo", "を"]],
	[["kk", "っ"], ["ss", "っ"], ["nn", "ん"], ["tt", "っ"], ["pp", "っ"]],
	[["ga", "が"], ["gi", "ぎ"], ["gu", "ぐ"], ["ge", "げ"], ["go", "ご"]],
	[["za", "ざ"], ["ji", "じ"], ["zu", "ず"], ["ze", "ぜ"], ["zo", "ぞ"]],
	[["da", "だ"], ["dji", "ぢ"], ["dzu", "づ"], ["de", "で"], ["do", "ど"]],
	[["pa", "ぱ"], ["pi", "ぴ"], ["pu", "ぷ"], ["pe", "ぺ"], ["po", "ぽ"]],
	[["ba", "ば"], ["bi", "び"], ["bu", "ぶ"], ["be", "べ"], ["bo", "ぼ"]],
	[["", ""], ["", ""], ["", ""]],
	[["kya", "きゃ"], ["kyu", "きゅ"], ["kyo", "きょ"]],
	[["sha", "しゃ"], ["shu", "しゅ"], ["sho", "しょ"]],
	[["cha", "ちゃ"], ["chu", "ちゅ"], ["cho", "ちょ"]],
	[["nya", "にゃ"], ["nyu", "にゅ"], ["nyo", "にょ"]],
	[["hya", "ひゃ"], ["hyu", "ひゅ"], ["hyo", "ひょ"]],
	[["mya", "みゃ"], ["myu", "みゅ"], ["myo", "みょ"]],
	[["rya", "りゃ"], ["ryu", "りゅ"], ["ryo", "りょ"]],
	[["", ""], ["", ""], ["", ""]],
	[["", ""], ["", ""], ["", ""]],
	[["", ""], ["", ""], ["", ""]],
	[["gya", "ぎゃ"], ["gyu", "ぎゅ"], ["gyo", "ぎょ"]],
	[["jya", "じゃ"], ["jyu", "じゅ"], ["jyo", "じょ"]],
	[["dya", "ぢゃ"], ["dyu", "ぢゅ"], ["dyo", "ぢょ"]],
	[["bya", "びゃ"], ["byu", "びゅ"], ["byo", "びょ"]],
	[["pya", "ぴゃ"], ["pyu", "ぴゅ"], ["pyo", "ぴょ"]],
];



var katakana = [
	[["A", "ア"], ["I", "イ"], ["U", "ウ"], ["E", "エ"], ["O", "オ"]],
	[["KA", "カ"], ["KI", "キ"], ["KU", "ク"], ["KE", "ケ"], ["KO", "コ"]],
	[["SA", "サ"], ["SHI", "シ"], ["SU", "ス"], ["SE", "セ"], ["SO", "ソ"]],
	[["TA", "タ"], ["CHI", "チ"], ["TSU", "ツ"], ["TE", "テ"], ["TO", "ト"]],
	[["NA", "ナ"], ["NI", "ニ"], ["NU", "ヌ"], ["NE", "ネ"], ["NO", "ノ"]],
	[["HA", "ハ"], ["HI", "ヒ"], ["FU", "フ"], ["HE", "ヘ"], ["HO", "ホ"]],
	[["MA", "マ"], ["MI", "ミ"], ["MU", "ム"], ["ME", "メ"], ["MO", "モ"]],
	[["RA", "ラ"], ["RI", "リ"], ["RU", "ル"], ["RE", "レ"], ["RO", "ロ"]],
	[["YA", "ヤ"], ["", ""], ["YU", "ユ"], ["", ""], ["YO", "ヨ"]],
	[["WA", "ワ"], ["", ""], ["", ""], ["", ""], ["WO", "ヲ"]],
	[["KK", "ッ"], ["SS", "ッ"], ["NN", "ン"], ["TT", "ッ"], ["PP", "ッ"]],
	[["GA", "ガ"], ["GI", "ギ"], ["GU", "グ"], ["GE", "ゲ"], ["GO", "ゴ"]],
	[["ZA", "ザ"], ["JI", "ジ"], ["ZU", "ズ"], ["ZE", "ゼ"], ["ZO", "ゾ"]],
	[["DA", "ダ"], ["DJI", "ヂ"], ["DZU", "ヅ"],["DE", "デ"], ["DO", "ド"]],
	[["PA", "パ"], ["PI", "ピ"], ["PU", "プ"], ["PE", "ペ"], ["PO", "ポ"]],
	[["BA", "バ"], ["BI", "ビ"], ["BU", "ブ"], ["BE", "ベ"], ["BO", "ボ"]],
	[["", ""], ["", ""], ["", ""]],
	[["KYA", "キャ"], ["KYU", "キュ"], ["KYO", "キョ"]],
	[["SHA", "シャ"], ["SHU", "シュ"], ["SHO", "ショ"]],
	[["CHA", "チャ"], ["CHU", "チュ"], ["CHO", "チョ"]],
	[["NYA", "ニャ"], ["NYU", "ニュ"], ["NYO", "ニョ"]],
	[["HYA", "ヒャ"], ["HYU", "ヒュ"], ["HYO", "ヒョ"]],
	[["MYA", "ミャ"], ["MYU", "ミュ"], ["MYO", "ミョ"]],
	[["RYA", "リャ"], ["RYU", "リュ"], ["RYO", "リョ"]],
	[["", ""], ["", ""], ["", ""]],
	[["", ""], ["", ""], ["", ""]],
	[["", ""], ["", ""], ["", ""]],
	[["GYA", "ギャ"], ["GYU", "ギュ"], ["GYO", "ギョ"]],
	[["JYA", "ジャ"], ["JYU", "ジュ"], ["JYO", "ジョ"]],
	[["DYA", "ヂャ"], ["DYU", "ヂュ"], ["DYO", "ヂョ"]],
	[["BYA", "ビャ"], ["BYU", "ビュ"], ["BYO", "ビョ"]],
	[["PYA", "ピャ"], ["PYU", "ピュ"], ["PYO", "ピョ"]]
];



function generateTable(kana_type) {
	$("#legend_table").empty();

	var table = "<div id='kana_table'>";

	if (kana_type == "hiragana") {
		kana = hiragana;
		$("#hiragana_link").css("border-bottom", "4px solid #000");
		$("#katakana_link").css("border-bottom", "4px solid #9B0023");
	}
	else if (kana_type == "katakana") {
		kana = katakana;
		$("#hiragana_link").css("border-bottom", "4px solid #9B0023");
		$("#katakana_link").css("border-bottom", "4px solid #000");
	}

	table += "<div class='table_row'>";
	for (var i=0; i<16; i++) {
		table += "<div class='table_column'>";

		for (var j=0; j<5; j++) {
			table += "<div class='table_cell'><div class='kana_symbol'>" + kana[i][j][1] + "</div>" + "<div class='kana_legend'>" + kana[i][j][0] + "</div></div>";
		}

		table += "</div>";
	}
	table += "</div>";

	table += "<div class='table_row'>";
	for (var i=16; i<32; i++) {
		table += "<div class='table_column'>";

		for (var j=0; j<3; j++) {
			table += "<div class='table_cell'><div class='kana_symbol'>" + kana[i][j][1] + "</div>" + "<div class='kana_legend'>" + kana[i][j][0] + "</div></div>";
		}

		table += "</div>";
	}
	table += "</div>";

	table += "</div>";
	$("#legend_table").append(table);
}


